app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("author_id", "post_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["post_id", 3], ["text", "good"], ["created_at", "2023-07-28 11:31:59.942009"], ["updated_at", "2023-07-28 11:31:59.942009"]]
UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) + $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 3]]
---
  def create
    @post = Post.find(params[:post_id])  # Find the corresponding post based on the :post_id param
    @user = User.find(params[:user_id])  # Find the corresponding user based on the :user_id param

    @comment = @post.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save
      # Increment comments_counter in the post
      @post.increment!(:comments_counter)