app/controllers/likes_controller.rb

  def create
    @post = Post.find(params[:post_id])

    # Check if the user has already liked the post
    if @post.likes.where(user: current_user).exists?
      redirect_to user_post_path(user_id: params[:user_id], id: @post.id), alert: 'You have already liked this post.'
    else
      @like = Like.new(post: @post, user: current_user)

      if @like.save
        # Increment likes_counter in the post
        @post.increment!(:likes_counter)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "likes" ("author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["post_id", 3], ["created_at", "2023-07-28 11:37:02.173619"], ["updated_at", "2023-07-28 11:37:02.173619"]]
UPDATE "posts" SET "likes_counter" = COALESCE("likes_counter", 0) + $1 WHERE "posts"."id" = $2  [["likes_counter", 1], ["id", 3]]